#   3. 输入一个整数,此整数代表树干的高度,打印一棵如下形状的圣
#     诞树
#     如:
#       输入: 2
#     打印:
#      *
#     ***
#      *
#      *
#     如:
#       输入: 3
#     打印:
#       *
#      ***
#     *****
#       *
#       *
#       *

n = int(input("请输入树干的高度: "))
# 此方法在星号的左侧填入相应空格来实现
# 1. 先打印树叶部分
for line in range(1, n + 1):
    blank = n - line  # 计算左侧空格的个数
    star = 2 * line - 1  # 计算星号的个数
    print(' ' * blank + '*' * star)

# 树干部分:
blank = n - 1  # 计算树干左侧的空格个数
for line in range(1, n + 1):
    print(" " * blank + '*')

    