#   3. 已知有一个列表中存有很多数,还有重复的,如:
#      L = [1, 3, 2, 1, 6, 4, 2, ...., 98, 82]
#      1) 将列表中出现数字存入一个列表L2中
#         要求: 重复出现多次的数字只能在L2中保留一份(去重)
#      2) 将L列表中出现两次的数字存于另一个列表L3中,在L3中
#         只保留一份


L = [1, 3, 2, 1, 6, 4, 2, 98, 82]
L2 = []
for x in L:
    # 如果x已经在L2中出现了(忽略本次操作)
    if x in L2:
        pass
    # 否则,这是第一次现,把x加入到L2列表中
    else:
        L2.append(x)

print("L2 =", L2)

# 2) 将L列表中出现两次的数字存于另一个列表L3中,在L3中
# 只保留一份

L3 = []
for x in L:
    # 如果x在L中出现两次,且在L3中没有出现过.则把x入到入L3中
    # if L.count(x) == 2 and x not in L3:
    if x not in L3 and L.count(x) == 2:
        L3.append(x)

print("L3 =", L3)

