#   以下列表的中的数据进行排序
#     L = [(1, 5), (3, 9), (4, 1), (3, 6), (5, 3)]
#   1. 将列表内的五个元组按,第二个数据的从小到大的顺序进行排序
#     结果如下:
#     L = [(4, 1), (5, 3), (1, 5), (3, 6), (3, 9) ]

#   2. 将列表内的五个元组按第二个数的从大到小顺序进行排序,打印
#      排序之后的结果

#   3. 假设元组中的数据是数学直角坐标系的坐标,则按他们距离原点
#      的距离进行排序
#      (提示: 距离等同于 distance = sqrt(x**2 + y**2))


L = [(1, 5), (3, 9), (4, 1), (3, 6), (5, 3)]

def second_value(t):  # t绑定的是元组
    print("t=", t)
    return t[1]

L2 = sorted(L, key=second_value)
print("L2=", L2)
# L = [(4, 1), (5, 3), (1, 5), (3, 6), (3, 9) ]

# 2. 将列表内的五个元组按第二个数的从大到小顺序进行排序,打印
#     排序之后的结果
L3 = sorted(L, key=second_value, reverse=True)
print("L3=", L3)

# 3. 假设元组中的数据是数学直角坐标系的坐标,则按他们距离原点
#     的距离进行排序
#     (提示: 距离等同于 distance = sqrt(x**2 + y**2))
L4 = sorted(L, key=lambda t: (t[0]**2 + t[1]**2) ** 0.5)
print("L4=", L4)
