# 练习:
#   写一个程序.
#     1) 输入一些单词和解释,将单词作为键,解释作为值存于
#        字典中,当输入单词为空时结束输入

#     2) 然后进入查词过程(死循环)
#        输入单词,如果单词在字典中,则显示解释内容
#        如果单词不存在,则提示"没有此单词"
    


# 1) 输入一些单词和解释,将单词作为键,解释作为值存于
#     字典中,当输入单词为空时结束输入
words = {}  # 准备存入数据
while True:
    word = input("请输入单词: ")
    if word == '':  # if not word:
        break
    trans = input("请输入解释: ")
    words[word] = trans

print("形成的字典是:", words)



# 2) 然后进入查词过程(死循环)
#     输入单词,如果单词在字典中,则显示解释内容
#     如果单词不存在,则提示"没有此单词"
while True:
    w = input("请输入要查询的单词: ")
    if w in words:
        print('解释:', words[w])
    else:
        print("没有此单词")

