#   1. 输入一个整数,代表正方形的宽度,打印如下的正方型
#   (注: 用for语句嵌套实现)
#     如:
#       请输入: 5
#     打印:
#       1 2 3 4 5
#       1 2 3 4 5
#       1 2 3 4 5
#       1 2 3 4 5
#       1 2 3 4 5
#     如:
#       请输入: 3
#     打印:
#       1 2 3
#       1 2 3
#       1 2 3

w = int(input("请输入: "))
# 打印正方形
# for x in range(w):
for _ in range(w):
    # 每次执行到此处, 打印一行
    for y in range(1, w + 1):
        print(y, end=' ')
    print()  # 换行

# 打印:
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
#   1 2 3 4 5
# 如:
#   请输入: 3
# 打印:
#   1 2 3
#   1 2 3
#   1 2 3
